Перем КонтекстЯдра;
Перем Ожидаем;
Перем Утверждения;
Перем ГенераторТестовыхДанных;
Перем ЗапросыИзБД;
Перем УтвержденияПроверкаТаблиц;

#Область ЮнитТестирование

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра				= КонтекстЯдраПараметр;
	Ожидаем						= КонтекстЯдра.Плагин("УтвержденияBDD");
	Утверждения					= КонтекстЯдра.Плагин("БазовыеУтверждения");
	ГенераторТестовыхДанных		= КонтекстЯдра.Плагин("СериализаторMXL");
	ЗапросыИзБД					= КонтекстЯдра.Плагин("ЗапросыИзБД");
	УтвержденияПроверкаТаблиц	= КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц");

КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	
	НаборТестов.НачатьГруппу("СправочнаяИнформация",Истина);
	НаборТестов.Добавить("Help");
	НаборТестов.Добавить("Помощь");
	НаборТестов.Добавить("Справка");
	НаборТестов.Добавить("Хэлп");
	НаборТестов.Добавить("Хелп");
	
	НаборТестов.НачатьГруппу("МенеджерВременныхТаблиц",Истина);
	НаборТестов.Добавить("ПросмотрПустогоМенеджераВременныхТаблиц");
	НаборТестов.Добавить("ПросмотрНеПустогоМенеджераВременныхТаблиц");
	
	НаборТестов.НачатьГруппу("Запрос",Истина);
	
	//НаборТестов.Добавить("РеализацияНДС60ОплатаВозврат");

КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ТестированиеСправочнойИнформации

Процедура Help() Экспорт
	СправочнаяИнформация = Отладка.Help();
	ПроверитьСправочнуюИнформацию(СправочнаяИнформация);
КонецПроцедуры

Процедура Помощь() Экспорт
	СправочнаяИнформация = Отладка.Помощь();
	ПроверитьСправочнуюИнформацию(СправочнаяИнформация);
КонецПроцедуры

Процедура Справка() Экспорт
	СправочнаяИнформация = Отладка.Справка();
	ПроверитьСправочнуюИнформацию(СправочнаяИнформация);
КонецПроцедуры

Процедура Хелп() Экспорт
	СправочнаяИнформация = Отладка.Хелп();
	ПроверитьСправочнуюИнформацию(СправочнаяИнформация);
КонецПроцедуры

Процедура Хэлп() Экспорт
	СправочнаяИнформация = Отладка.Хэлп();
	ПроверитьСправочнуюИнформацию(СправочнаяИнформация);
КонецПроцедуры

Процедура ПроверитьСправочнуюИнформацию(Знач СправочнаяИнформация)
	Утверждения.ПроверитьТип(СправочнаяИнформация,"Структура", "Ожидалось получение справки по работе с расширением в виде структуры");
КонецПроцедуры	

#КонецОбласти

#Область ТестированиеМенеджераВременныхТаблиц

Функция ПросмотрПустогоМенеджераВременныхТаблиц() Экспорт 
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ТаблицыМенеджераВременныхТаблиц = Отладка.Вижу(МенеджерВременныхТаблиц);
	Утверждения.ПроверитьТип(ТаблицыМенеджераВременныхТаблиц,"Структура", "Ожидалось получение информации для просмотра таблиц менеджера временных таблиц.");
	
КонецФункции	

Функция ПросмотрНеПустогоМенеджераВременныхТаблиц() Экспорт 
	
	МенеджерВременныхТаблиц = НовыйМенеджерВременных();
	ТаблицыМенеджераВременныхТаблиц = Отладка.Вижу(МенеджерВременныхТаблиц);
	Утверждения.ПроверитьТип(ТаблицыМенеджераВременныхТаблиц,"Структура", "Ожидалось получение информации для просмотра таблиц менеджера временных таблиц.");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйТаблицаАлфавита()

	ТаблицаАлфавита = Новый ТаблицаЗначений;
	ТаблицаАлфавита.Колонки.Добавить("НомерБуквы",	Новый ОписаниеТипов("Число"),	"Номер Буквы алфавита");
	ТаблицаАлфавита.Колонки.Добавить("КодБуквы",	Новый ОписаниеТипов("Число"),	"Код символа алфавита");
	ТаблицаАлфавита.Колонки.Добавить("Буква",		Новый ОписаниеТипов("Строка"),	"Буква алфавита");
	
	Для КодБуквы = 1040 По 1103 Цикл
		НоваяБуква = ТаблицаАлфавита.Добавить();
		НоваяБуква.НомерБуквы 	= ТаблицаАлфавита.Количество();
		НоваяБуква.КодБуквы 	= КодБуквы;
		НоваяБуква.Буква 		= Символ(КодБуквы);
	КонецЦикла;
	
	Возврат ТаблицаАлфавита;
	
КонецФункции

Функция НовыйМенеджерВременных()
	
	ТаблицаАлфавита = НовыйТаблицаАлфавита();
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаАлфавита.*
	|ПОМЕСТИТЬ ВТТаблицаАлфавита
	|ИЗ
	|	&ТаблицаАлфавита КАК ТаблицаАлфавита";
	
	Запрос.УстановитьПараметр("ТаблицаАлфавита",ТаблицаАлфавита);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат МенеджерВременныхТаблиц;
	
КонецФункции	

#КонецОбласти

