Перем КонтекстЯдра;
Перем Ожидаем;
Перем Утверждения;
Перем ГенераторТестовыхДанных;
Перем ЗапросыИзБД;
Перем УтвержденияПроверкаТаблиц;

#Область ЮнитТестирование

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра				= КонтекстЯдраПараметр;
	Ожидаем						= КонтекстЯдра.Плагин("УтвержденияBDD");
	Утверждения					= КонтекстЯдра.Плагин("БазовыеУтверждения");
	ГенераторТестовыхДанных		= КонтекстЯдра.Плагин("СериализаторMXL");
	ЗапросыИзБД					= КонтекстЯдра.Плагин("ЗапросыИзБД");
	УтвержденияПроверкаТаблиц	= КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц");

КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	
	НаборТестов.НачатьГруппу("СправочнаяИнформация",Истина);
	НаборТестов.Добавить("Help");
	НаборТестов.Добавить("Помощь");
	НаборТестов.Добавить("Справка");
	НаборТестов.Добавить("Хэлп");
	НаборТестов.Добавить("Хелп");
	
	НаборТестов.НачатьГруппу("МенеджерВременныхТаблиц",Истина);

	НаборТестов.НачатьГруппу("Запрос",Истина);

	//НаборТестов.Добавить("РеализацияНДС60ОплатаВозврат");

КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ТестированиеСправочнойИнформации

Процедура Help() Экспорт
	СправочнаяИнформация = Отладка.Help();
	ПроверитьСправочнуюИнформацию(СправочнаяИнформация);
КонецПроцедуры

Процедура Помощь() Экспорт
	СправочнаяИнформация = Отладка.Помощь();
	ПроверитьСправочнуюИнформацию(СправочнаяИнформация);
КонецПроцедуры

Процедура Справка() Экспорт
	СправочнаяИнформация = Отладка.Справка();
	ПроверитьСправочнуюИнформацию(СправочнаяИнформация);
КонецПроцедуры

Процедура Хелп() Экспорт
	СправочнаяИнформация = Отладка.Хелп();
	ПроверитьСправочнуюИнформацию(СправочнаяИнформация);
КонецПроцедуры

Процедура Хэлп() Экспорт
	СправочнаяИнформация = Отладка.Хэлп();
	ПроверитьСправочнуюИнформацию(СправочнаяИнформация);
КонецПроцедуры

Процедура ПроверитьСправочнуюИнформацию(Знач СправочнаяИнформация)
	Утверждения.ПроверитьТип(СправочнаяИнформация,"Структура", "Ожидалось получение справки по работе с расширением в виде структуры");
КонецПроцедуры	

#КонецОбласти

